# DisplayLayerScaleDialog

## Description
Brings up the Layer Scale dialog.

```pascal
PROCEDURE DisplayLayerScaleDialog;
```

```python
def vs.DisplayLayerScaleDialog():
    return None
```

## Remarks
Brings up the Layer Scale dialog.

## Version
Availability: from VectorWorks12.0

## Category
* Layers